Repository: FelipeGorostiaga/PAW-TravelApp
Catalog: frontend-angular/src/locale/messages.*.xlf
Languages: es

# about.title
source: Software Engineering Student @ Instituto Tecnologico de Buenos Aires
es: Ingeniería en Informática @ Instituto Tecnológico de Buenos Aires

# advanced-search.title
source: Advanced Search
es: Búsqueda Avanzada

# advanced-search.name
source: Name
es: Nombre

# advanced-search.placeholder
source: Enter a trip name...
es: Ingrese un nombre de viaje...

# advanced-search.startDate
source: Start date
es: Fecha de inicio

# advanced-search.endDate
source: End date
es: Fecha de finalización

# advanced-search.place
source: Place
es: Lugar

# advanced-search.searchButton
source: Search
es: Buscar

# advanced-search.noTripsMessage
source: No trips where found with selected specifications
es: No se encontraron viajes con esas especificaciones

# advanced-search.errorMessage
source: Error getting trips, please try again later
es: Hubo un error buscando viajes, pruebe de nuevo más tarde

# complete-rates.noRatesAlert
source: You have no pending rates
es: No tienes calificaciones pendientes

# rate-form.title
source: Pending rates
es: Calificaciones pendientes

# rate-form.placeholder
source: Write a short review (max 200 characters)
es: Escriba su opinión sobre viajar con esta persona (max 200 caracteres)

source: Please write a review, at least 20 characters long
es: Por favor escriba una opinión de al menos 20 caracteres

# rate-form.submitButton
source: Submit
es: Enviar

# create-trip.title
source: Create trip
es: Crear viaje

# create-trip.mapsError
source: Invalid google maps location
es: Lugar inválido

# create-trip.name
source: Name
es: Nombre

# create-trip.namePlaceholder
source: Enter a name for your trip
es: Ingrese un nombre para su viaje

# create-trip.name.required
source: Name is required
es: Nombre es obligatorio

# create-trip.name.minlength
source: Name must be at least 5 characters long
es: Debe tener al menos 5 caracteres

# create-trip.name.maxlength
source: Maximum length is 30 characters
es: Máximo 30 caracteres

# create-trip.description
source: Description
es: Descripción

# create-trip.descriptionPlaceholder
source: Write a description for your new adventure!
es: Escriba una descripción para su viaje

# create-trip.description.required
source: Description is required
es: Descripción es obligatorio

# create-trip.description.minlength
source: Description must be at least 25 characters long
es: Debe tener al menos 25 caracteres

# create-trip.description.maxlength
source: Maximum length is 400 characters
es: Máximo 400 caracteres

# create-trip.datesError
source: Invalid dates
es: Fechas inválidas

# create-trip.startDate
source: Start
es: Comienzo

# create-trip.startDate.required
source: Start date is required
es: Fecha de comienzo es obligatoria

# create-trip.startDate.invalidInterval
source: Invalid dates
es: Fechas inválidas

# create-trip.endDate
source: End
es: Finalización

# create-trip.endDate.required
source: End date is required
es: Fecha de finalización es obligatoria

# create-trip.endDate.invalidInterval
source: Invalid dates
es: Fechas inválidas

# create-trip.googlePlacePlaceholder
source: Enter location
es: Ingrese un lugar

# create-trip.placeInput.required
source: Location is required
es: Lugar es obligatorio

# forbidden.title
source: Error 403 - Forbidden
es: Error 403 - Prohibido

# forbidden.errorDetails
source: You don't have the required permissions to access this page!
es: No tienes permisos adecuados para acceder a esta página

# forbidden.homeButton
source: Home
es: Inicio

# page-not-found.title
source: Error 404 - Page Not Found
es: Error 404 - Página No Encontrada

# page-not-found.errorDetails
source: Sorry, an error has occurred, requested page was not found!
es: Ocurrió un error, la página que deseas aceeder no fue encontrada

# page-not-found.homeButton
source: Home
es: Inicio

# home.noTripsAlert
source: There are no available trips
es: No se encontraron viajes

# index.companyDescription
source: The best place to make new friends and travel the world!
es: El mejor lugar para conocer nuevos amigos y viajar por el mundo!

# index.registerButton
source: Create account
es: Crear una cuenta

# index.signinButton
source: Sign in
es: Ingresar

# login.title
source: Sign in
es: Ingresar

# login.credentialsError
source: Invalid username or password
es: Usuario y/o contraseña inválidos

# login.verificationError
source: Please verify your email
es: Por favor verifique su email

# login.serverError
source: Unexpected error, try again later
es: Error inesperado, intente nuevamente más tarde

# login.passwordPlaceholder
source: password
es: contraseña

# login.submitButton
source: Sign in
es: Ingresar

# login.noAccount
source: Dont have an account? <a routerLink="/register"><u>Register</u></a>
es: No tienes una cuenta? <a routerLink="/register"><u>Regístrate</u></a>

# navbar.home
source: Home<span class="sr-only">(current)</span>
es: Inicio<span class="sr-only">(current)</span>

# navbar.myTrips
source: My trips
es: Mis viajes

# navbar.createTrip
source: Create trip
es: Crear viaje

# navbar.advancedSearch
source: Advanced Search
es: Búsqueda Avanzada

# navbar.pendingRates
source: Pending Rates
es: Calificaciones Pendientes

# navbar.about
source: About
es: Contacto

# navbar.searchPlaceholder
source: Search trips by name...
es: Buscar por nombre

# navbar.searchButton
source: Search
es: Buscar

# profile.editProfileButton
source: Edit profile
es: Editar perfil

# profile.due
source: <i class="fa fa-calendar mr-1"></i>Due
es: <i class="fa fa-calendar mr-1"></i>Pendientes

# profile.active
source: <i class="fa fa-suitcase mr-1"></i>In progress
es: <i class="fa fa-suitcase mr-1"></i>En progreso

# profile.completed
source: <i class="fa fa-check mr-1"></i>Completed
es: <i class="fa fa-check mr-1"></i>Completados

# profile.rate
source: <i class="fa fa-heart mr-1"></i>Rate
es: <i class="fa fa-heart mr-1"></i>Calificación

# profile.aboutMe
source: About Me
es: Sobre mi

# profile.recentReviews
source: Recent reviews
es: Calificaciones recientes

# profile.showAllLink
source: Show all
es: Mostrar todas

# profile.editTrip.title
source: Edit Trip
es: Editar viaje

# profile.fileInput
source: File input
es: Imágen

# profile.editTrip.invalidFileExtension
source: Invalid file extension, only jpg and png allowed.
es: Extension inválida, solo imagenes .jpg y .png permitidas

# profile.editTrip.invalidFileSize
source: Image size too big (max 5MB)
es: Imagen demsiado grande (max 5MB)

# profile.editTrip.aboutMe
source: About Me
es: Sobre mi

# profile.editTrip.biography.required
source: Biography
es: Biografía

# profile.editTrip.biography.maxlength
source: Max length is 150 characters
es: Máximo 150 caracteres

# profile.editTrip.submitButton
source: Submit
es: Enviar

# profile.editTrip.closeButton
source: Close
es: Cerrar

# register.title
source: Register
es: Registrarse

# register.firstname
source: First Name
es: Nombre

# register.firstname.required
source: First name is required
es: Nombre es obligatorio

# register.firstanme.minlength
source: Min length is 2 characters
es: Mínimo 2 caracteres

# register.firstname.maxlength
source: Max length is 20 characters
es: Máximo 20 caracteres

# register.lastname
source: Last Name
es: Apellido

# register.lastname.required
source: Last Name is required
es: Apellido es obligatorio

# register.lastname.minlength
source: Min length is 2 characters
es: Mínimo 2 caracteres

# register.lastname.maxlength
source: Max length is 20 characters
es: Máximo 20 caracteres

# register.email.required
source: Email is required
es: Email es obligatorio

# register.email.emailFormat
source: Email must be a valid email address
es: Debe ser una casilla de email válida

# register.nationality
source: Nationality
es: Nacionalidad

# register.nationality.required
source: Nationality is required
es: Nacionalidad es obligatorio

# register.password
source: Password
es: Contraseña

# register.password.required
source: Password is required
es: Contraseña es obligatoria

# register.password.minlength
source: Password must be at least 6 characters
es: Debe tener al menos 6 caracteres

# register.password.maxlength
source: Max length 20 characters
es: Máximo 20 caracteres

# register.confirmPassword
source: Confirm Password
es: Confirmar contraseña

# register.confirmPassword.required
source: Confirm Password is required
es: Confirmar contraseña es obligatorio

# register.confirmPassword.noMatch
source: Passwords must match
es: Las contraseñas deben coincidir

# register.birthday
source: Date of birth
es: Fecha de nacimiento

# register.birthdayPlaceholder
source: Enter a valid birthday
es: Ingrese una fecha de nacimiento válida

# register.birthday.required
source: Date of birth is required
es: Fecha de nacimiento es obligatoria

# register.birthday.invalidDate
source: Invalid date
es: Fecha Inválida

# register.birthday.invalidFormat
source: Must be a valid date format 'dd/mm/yyy'
es: Formato inválido, debe tener formato dd/mm/yyyy

# register.male
source: Male
es: Masculino

# register.female
source: Female
es: Femenino

# register.sex.required
source: Sex is required
es: Sexo es obligatorio

# register.termsAndConditions
source: Accept Terms & Conditions
es: Aceptar Términos & Condiciones

# register.termsAndConditions.required
source: Accept Terms & Conditions is required
es: Términos & Condiciones es obligatorio

# register.registerButton
source: Register
es: Registrarse

# register.cancelButton
source: Cancel
es: Cancelar

# register.alreadyRegistered
source: <p>Already have an account? <a routerLink="/login" style="color: #0062cc"><u>Sign in</u></a></p>
es: <p>Ya tienes una cuenta? <a routerLink="/login" style="color: #0062cc"><u>Ingresar</u></a></p>

# verification-result.congrats
source: Congratulations!
es: Felicitaciones!

# verification-result.success
source: Your account has been successfully verified
es: Su cuenta ha sido verificada con éxito

# verification-result.signinButton
source: Sign in
es: Ingresar

# verification-result.error
source: Unexpected error, please try again later
es: Error inesperado, pruebe de nuevo más tarde

# verification.registerSuccess
source: Register Successful
es: Registro exitoso

# verification.checkEmail
source: Please check your email to confirm your account.
es: Por favor, revise su email para confirmar su cuenta

# activities.emptyAlert
source: This trip has no activities
es: Este viaje no tiene actividades

# activities.addButton
source: Add activity
es: Agregar actividad

# activities.create.name
source: Name
es: Nombre

# activities.create.namePlaceholder
source: Give your activity a name
es: Nombre para su actividad

# activities.create.name.required
source: Name is required
es: Nombre es obligatorio

# activities.create.name.minlength
source: Min 6 characters
es: Mínimo 6 caracteres

# activities.create.name.maxlength
source: Max 25 characters
es: Máximo 25 caracteres

# activities.create.category
source: Category
es: Categoría

# activities.create.category.sports
source: Sports
es: Deportiva

# activities.create.category.romantic
source: Romantic
es: Romántica

# activities.create.category.adventure
source: Adventure
es: Aventura

# activities.create.category.family
source: Family
es: Familia

# activities.create.category.friends
source: Friends
es: Amigos

# activities.create.category.business
source: Business
es: Negocios

# activities.create.category.relax
source: Relax
es: Relajación

# activities.create.category.nightlife
source: Nightlife
es: Nocturna

# activities.create.category.required
source: Category is required
es: Categoría es obligatoria

# activities.create.startDate
source: Start date
es: Fecha de comienzo

# activities.create.startDate.required
source: Start date is required
es: Fecha de comienzo es obligatoria

# activities.create.startDate.invalidDate
source: Invalid dates
es: Fechas inválidas

# activities.create.endDate
source: End date
es: Fecha de finalización

# activities.create.endDate.required
source: End date is required
es: Fecha de finalización es obligatoria

# activities.create.endDate.invalidDate
source: Invalid dates
es: Fechas inválidas

# activities.create.location
source: Location
es: Lugar

# activities.create.locationPlaceholder
source: Enter location
es: Ingrese un lugar

# activities.create.location.required
source: Location is required
es: Lugar es obligatorio

# activities.create.description
source: Description
es: Descripción

# activities.create.descriptionPlaceholder
source: Write a description for this activity...
es: Escriba una descripción para la actividad

# activities.create.description.required
source: Description is required
es: Descripción es obligatoria

# activities.create.description.minlength
source: Min length is 10 characters
es: Mínimo 10 caracteres

# activities.create.description.maxlength
source: Max length is 300 characters
es: Máximo 300 caracteres

# activities.create.createButton
source: Create
es: Crear

# activities.create.closeButton
source: Close
es: Cerrar

# map-activity.deleteButton
source: Delete
es: Eliminar

# chat.noComments
source: Be the first to write a comment...
es: Sé el primero en escribir un comentario

# chat.sendComment
source: Send
es: Enviar

# trip.information.startDate
source: Start date: {{startDate | date}}
es: Fecha de inicio: {{startDate | date}}

# trip.information.endDate
source: End date: {{endDate | date}}
es: Fecha de finalización: {{endDate | date}}

# trip.information.inviteUserButton
source: Invite User
es: Invitar usuario

# trip.information.exitTripButton
source: Exit
es: Salir

# trip.information.requestJoinButton
source: Request to join
es: Quiero unirme!

# trip.information.finishTripButton
source: Finish Trip
es: Finalizar viaje

# trip.information.inviteUser.title
source: Invite user
es: Invitar usuario

# trip.information.inviteUser.success
source: User invite sent.
es: Invitación enviada

# trip.information.inviteUser.error
source: User was already invited.
es: El usuario ya fue invitado.

# trip.information.inviteUser.closeButton
source: Close
es: Cerrar

# trip.information.editTrip.title
source: Edit Trip
es: Editar viaje

# trip.information.editTrip.file
source: File input
es: Archivo

# trip.information.editTrip.name
source: Name
es: Nombre

# trip.information.editTrip.name.required
source: Name is required
es: Nombre es obligatorio

# trip.information.editTrip.name.minlength
source: Min length is 5 characters
es: Mínimo 5 caracteres

# trip.information.editTrip.name.maxlength
source: Max length is 15 characters
es: Máximo 15 caracteres

# trip.information.editTrip.description
source: Description
es: Descripción

# trip.information.editTrip.description.required
source: Description is required
es: Descripción es obligatoria

# trip.information.editTrip.description.minlength
source: Min length is 25 characters
es: Mínimo 25 caracteres

# trip.information.editTrip.description.maxlength
source: Max length is 400 characters
es: Máximo 400 caracteres

# trip.information.editTrip.submitButton
source: Submit
es: Enviar

# trip.information.editTrip.closeButton
source: Close
es: Cerrar

# respond-invite.error
source: Invalid token or invitation does not exist
es: Token inválido o la invitación expiró

# respond-invite.success
source: You have joined {{tripName}}
es: Te has unido a {{tripName}}

# respond-invite.tripButton
source: Go to Trip
es: Ir al viaje

# respond-invite.declined
source: You have declined the invitation to join {{tripName}}
es: Has rechazado la invitación para unirte a {{tripName}}

# respond-invite.homeButton
source: Home
es: Inicio

# respond-join-req.serverError
source: Unexpected error, please try again later.
es: Error inesperado, por favor intente más tarde

# respond-join-req.alreadyResponded
source: Request was already responded by another trip administrator.
es: La petición ya fue respondida por otro administrador.

# respond-join-req.tripCompleted
source: This trip was already marked as complete, you can no longer invite or accept new users.
es: El viaje fue marcado como completado, no se puede invitar o aceptar nuevos usuarios

# respond-join-req.accepted
source: User was successfully added to the trip.
es: El usuario fue añadido al viaje con éxito

# respond-join-req.denied
source: Join request was denied.
es: La petición para unirse fue rechazada

# respond-join-req.tripButton
source: Go to trip
es: Ir al viaje

# trip.informationTab
source: Information
es: Información

# trip.activitiesTab
source: Activities
es: Actividades

# user-rates.noRates
source: This user has no available rates
es: Este usuario no tiene calificaciones disponibles

# user-rates.error
source: Error fetching data from server, please try again later
es: Error obteniendo datos del servidor, inténtelo más tarde

# user-trips.noTrips
source: You are not a member of any trip
es: No eres un miembro de este viaje
